from app import  db , Info, Age

db.create_all()


age1 = Age(name="العصر الاول من الخليقه الي دعوه ابراهيم", 
            description="""يعتبر اول عصر ليس في العهد القديم فقط بل في الكتاب المقدس كله ويبدا من خلق ادم حتي دعوه ابراهيم ولم يكن فيه الكثير من الأنبياء فهو يحتوي علي ما يقارب ثلاث انبيه و هم"""   )
db.session.add(age1)

age2 = Age(name="العصر الثاني من دعوه ابراهيم الي الخروج")
db.session.add(age2)


age3 = Age(name="العصر الثالث من الخروج الي انقسام المملكه ")
db.session.add(age3)


age4 = Age(name= "العصر الرابع من انقسام المملكه الي السبي")
db.session.add(age4)


age5 = Age(name= "العصر الخامس الفتره الاشوريه بعد سقوط السامره")
db.session.add(age5)


age6 = Age(name= "العصر السادس امبراطوريه بابل والسبي البابلي")
db.session.add(age6)


age7 = Age(name= "العصر السابع الفتره الفارسيه")
db.session.add(age7)

age8 = Age(name= "العصر الثامن الفتره بين العهدين")
db.session.add(age8)


db.session.commit()


noh = Info(
    title = "نوح",
    story = """اسم سامي معناه "راحة" وهو ابن لامك Lamech ابن متوشالح بن أخنوخ بن يارد بن مهلليئل بن قينان ابن أنوش بن شيث بن آدم.
            و سماه أبوه نوحًا قائلا: "هذا يعزينا عن عملنا وتعب أيدينا من قبل الأرض التي لعنها الرب" (تك 5: 29).
           كان نوح رجلًا بارًا وكاملًا. وسار مع الرب مثل أخنوخ، وأعلن إيمانه المطلق بالله وكرز به (2 بط 2: 5؛ عب 11: 7).
            وكان لنوح زوجة وثلاثة بنين. وكانت اسماء بنيه ساما وحاما ويافث. وكان لكل من هؤلاء البنين زوجة. لذلك كان هنالك ثمانية اشخاص في عائلة نوح.
           و بسبب أن البشر كانوا قد فسدوا وخرجوا عن الطريق القويم واقترفوا الآثام وعملوا الشر حتى حزن الرب انه عمل الإنسان في الأرض وقرر أن يمحوه من العالم. 
           ولكن الله استثنى نوحًا لأنه كان يجد نعمى في عيني الرب. فاخبره الله عن نيته بمحو البشر وأمره أن يصنع لنفسه فلكًا من خشب ليحتمي به وينجو بنفسه ومعه عائلته وبعض الحيوانات.
            فقد امره بأن يبني فلكا كبيرا. وكان هذا الفلك واسعا كسفينة، الا انه كان أشبه بصندوق كبير مستطيل. ‹اجعل ارتفاعه ثلاث طبقات، قال الله، ‹وضع فيه غرفا. فكانت الغرف لنوح وعائلته، والحيوانات، والطعام اللازم لهم جميعا.
           فأطاع نوح وبنوه اومر الله وباشروا البناء. أما الناس الآخرون فضحكوا. وظلوا اشرارا. ولم يصدّق احد نوحا عندما اخبرهم ما كان الله مزمعا ان يفعل واستغرق بناء الفلك وقتا طويلا لانه كان كبيرا جدا. وأخيرا، بعد سنوات كثيرة، أُكمل..
           و دخل نوح ومعه امرأته وبنوه الثلاثة ونساؤهم وزوج من كل نوع من البهائم النجسة ومن الطيور وسبعة أزواج من البهائم والطيور الطاهرة. وبعد سبعة أيام نزل طوفان على الأرض واستمر المطر ينزل لمدة أربعين يومًا وليلة وغرق به كل من كان على الأرض من بشر، ومن حيوانات
           وكف المطر بعد الأربعين يومًا وليلة وابتدأت المياه تنحسر. وأطلق نوح غرابًا ثم حمامة عدة مرات حتى لم تَعُد الحمامة. وأدرك أن الماء قد انحسر ولكن نوحًا لم يخرج من الفلك
           (8 إلا بعد أن دعاه الله إلى ذلك. وبنى نوح مذبحًا للرب وقدم فوقه بعض الحيوانات الطاهرة. ولما تنسم الله رائحة الرضا قرر ألا يعلن الأرض بعد ولا يميت كل حيّ (تك """ 
           , age_id = age1.id)
db.session.add(noh)

ebrahim = Info(
    title = "ابراهيم" ,
    story = """ اختار الله إبراهيم لكي يكونَ لنفسه شعبًا، انتزع إبراهيم من حضارة الكلدان المتقدمة إلى بلد لم يملك فيه سوى قبر، كان في أور الكلدانيين كانت هناك حضارة كبيرة.
                 ثم يعده بنسل لا يعد من الكثرة ويتمهل ويتأنى في ذلك حتى يصبح إبراهيم عمره 100 وعمرسارة 90 حتى يعطيه هذاالابن.
    
                  وما أن كبر هذا الابن حتى طلب منه أن يقدمه له محرقة ويطيع إبراهيم ويقوَّم الله إيمان إبراهيم بهذا الامتحان إلى أن أصبح إبراهيم أب لجمهور كبير من الأمم كما جاء في (تك 17: 5) "فَلاَ يُدْعَى اسْمُكَ بَعْدُ أَبْرَامَ بَلْ يَكُونُ اسْمُكَ إِبْرَاهِيمَ لأَنِّي أَجْعَلُكَ أَبًا لِجُمْهُورٍ مِنَ الأُمَمِ." قال له هذا ولم يتحقق إلاّ بعد 25 سنة ومع ذلك كان إيمان إبراهيم إيمان عظيم.
                  
                  في (تك 12: 1) " وَقَالَ الرَّبُّ لأَبْرَامَ: "اذْهَبْ مِنْ أَرْضِكَ وَمِنْ عَشِيرَتِكَ وَمِنْ بَيْتِ أَبِيكَ إِلَى الأَرْضِ الَّتِي أُرِيكَ. " أترك أهلك وعشيرتك وهنا أمر لكن هذا الأمر ارتبط بوعد، ويخرج فعلًا إبراهيم وسلامه وعد الله لأن الله لا بُد أن يتمم هذا الوعد، فأجعلك أمة عظيمة وأباركك وأعظم اسمك وتكون بركة في (تك 12: 2)
    
                  ويولد لإبراهيم ابنان: الأول حسب الجسد وهو إسماعيل والثاني حسب الوعد وهو إسحق
                  وإن كان أمره "خذ ابنك وحيدك الذي تحبه إسحق وأصعده لي محرقة " وهنا أيضًا أطاع إبراهيم لكن الله يمسك بيده في اللحظة الحاسمة ويستعيده إبراهيم كمن قام من الأموات. """
                  , age_id = age1.id) 

db.session.add(ebrahim)

sara = Info(
    title = "ساره" ,
    story = """ زوجت سارة من إبراهيم في أور الكلدانيين وكانت أصغر منه بعشر سنوات، وعندما خرج إبراهيم من حاران كان عمر سارة 65 سنة، ولكنها كانت جميلة بالرغم مما بلغت من العمر، وكانت محتفظة بقوتها وشبابها. هذا ما يذكره عنها سفر التكوين.
        
                    بعد مغادرة حاران وقبل النزول إلى مصر، تحدث إبراهيم مع سارة وطلب منها أن تخفي أنها زوجته وتقول إنها أخته، وقد كانت بالفعل أخته (ابنة أبيه وليست ابنة أمه) وكان سبب طلب إبراهيم ذلك خوفه من أن يلفت جمال سارة نظر المصريين إليها، فيقتلونه ويأخذونها، وأطاعت سارة زوجها، فأخذها ملك مصر، ولكن الله منعه من الاقتراب إليها، ووبخ فرعون زوجها عندما أعلن له الله الأمر.
                    
                    وبعد عدة سنين سكن إبراهيم في جرار، وقال عن سارة إنها أخته، فطلب أبيمالك أن يتزوج منها، ربما لغرض إيجاد تحالف مع الأمير البدوي القوي، وهنا أيضًا منع الله أبيمالك من الإساءة إلى سارة.
                    
                    وبرغم من التفسيرات التي تأتي في اتجاه ضعف إيمان إبراهيم في هذا الموقف أو كذبه "لأنه ذكر نصف الحقيقة من ناحية أنها أخته ولم يقل زوجته"، إلا أنها من ناحية أخرى قد تدل على مدى علم إبراهيم بجمال سارة حد الارتباك الذي يجعله يقع في كل هذه الأخطاء. كما تشهد القصة أيضا عن محبة وطاعة سارة لزوجها مهما كان خطأه.
                    
                    وترسخ الكنيسة لهذه الفكرة فيما يعرف بوصية الكنيسة للعروس، والتي تتلى أثناء طقس صلاة الإكليل على الزوجين، فتقول الكنيسة في وصيتها للعروس: "كونى معه كما كانت أمنا سارة مطيعة لأبينا إبراهيم وكانت تخاطبه يا سيدى. فنظر الله إلى طاعتها له وبارك عليها وأعطاها إسحق بعد الكبر. وجعل نسلها مثل نجوم السماء والرمل على شاطئ البحر".
                    
                    وعندما كان عمر سارة 75 سنة ضعف إيمانها في إتمام وعد الله من حيث حصولها على نسل، فأشارت على زوجها أن يتزوج من جاريتها هاجر، ولكنه كان رافضًا في البداية إلا أنه وافق استجابة لها، فالطاعة والمحبة كانت متبادلة بين الاثنين اللذين لم يذكر الكتاب عنهما خلافًا بل كان كلاهما يقدر ويحترم الآخر مهما ارتكب من أخطاء.
  """, age_id = age1.id) 

db.session.add(sara)

eshak = Info(
    title = "اسحاق" ,
    story = """ قصة إسحاق تركز على دوره كابن إبراهيم ووريث وعد الله لأبيه. إسحاق وُلد لإبراهيم وسارة وهو الابن الوحيد لهما بعد أن تم اختبار إيمان إبراهيم بأمر الله بذبحه.

إسحاق يُصف بأنه رجل بار ومطيع لله. وفي قصة إسحاق، يُظهر الله رحمته ووفائه لعهده مع إبراهيم ويفرض بركته على إسحاق. يُعد إسحاق أيضًا رمزًا للتضحية والطاعة لله، حيث كان على استعداد لتنفيذ أمر الله بذبحه وتقديمه كقربان.

بعد وفاة إبراهيم، يُعاين إسحاق لبنات الأمم ويختار ريبقا لتكون زوجته. ومن ثم، يُولد لإسحاق ابنان، إسو ويعقوب. وتتعقد قصة إسحاق بسبب التنافس والصراع بين ابنيه.

إسحاق يُصف بأنه رجل متواضع وهادئ، ويعيش حياة مستقرة في أرض كنعان. ويُعد إسحاق جزءًا أساسيًا من تاريخ الشعب الإسرائيلي والأجداد المشتركين للمسيح.

تعتبر قصة إسحاق مثالًا على الطاعة والتضحية ورحمة الله. وقد تمجد إسحاق كابن الوفاء والبر في التاريخ الديني.
 """
 , age_id = age2.id)

db.session.add(eshak)

yacob = Info(
    title = "يعقوب" ,
    story = """يعقوب النبي من الاباء الكبار للعبرانيين وهو ابن اسحاق ورفقه وتوأم عيسو وكان ساكنا عند بئر لحي رعي وكان يسكن في الخيمه واخوه يصطاد وكان يعقوب انانيا فا اشترى من اخوه بكوريته بمقابل طبق عدس وكان اسحاق يحب عيسو اكثر وكانت رفقه تحب يعقوب اكثر ف غش اسحاق واخذ يعقوب بركه بدلا من اخوه فهرب  يعقوب خوفا من اخيه وفي اثناء هروبه في الغروب حلم بسلم من الارض الى السماء وفيه ملائكه صاعدة ونازله السلم وفي الصباح اكمل هروبه الي  بيت لبان خاله وهناك حب ابنه خاله راحيل ومكث عند لبان 7 سنين فتزوج ليئه اخت راحيل وانجب منها 6 اولاد وبنت ثم تزوج راحيل و لقب باسرائيل بسبب صراعيه مع الله """
    , age_id = age2.id)

db.session.add(yacob)

mouse = Info(
    title = "موسي" ,
    story = """ قسم حياته الي ثلاث قسمين الاول من الميلاد حتي سن الأربعين : ولد موسي في الوقت الذي كان يشدد فيه الفرعون بقتل الصبيان العبرانيين فأخفاه والده ثلاثه اشهر و بعدها وضعته امه يوكابد في سفط علي حافه النهر 
                      ثم وقفت مريم اخته تراقبه من بعيد ,فلما نزلت ابنه فرعون لتغتسل في النهر ورأت الولد رق قلبها فقالت هذا من اولاد العبرانيين فقالت مريم هل اذهب واحضر لك مرضعه فقالت لها الابنه اذهبي فذهبت وجعت امها يوكابد وربته ابنه فرعون علي يد معلمين مهره في جميع الفنون في مصر . والقسم الثاني هو من اول سن الاربعين حتي النهايه : عندما بلغ الاربعين كان قد اتقن كل اسرار الكهنوت وعرف الجميع بابن ابنه فرعون ولو عاش في ذلك المنصب لبلغ رتبه بين القوم غير ان الله قسم له ما هو اعظم من ذلك وهو ان يكون قائد شعبه فدبر الله ذهابه الي البريه وحدث انه راي رجلا مصري يضرب عبراني فقتل المصري وطمره في الرمل وأنقذ اخاه ولما انتشر الخبر هرب موسي وسكن في البريه وفي احدي الايام رأي عليقه لا تحترق وسمع صوت يأمره بأن يذهب لمصر ليكون قائدا لشعب الله ووعده الله بأن يشد ازره بأخيه هارون مساعدا بعدها ذهب موسي الي مصر وحدثت القصه المعروفه من الضربات العشر حتي الخروج من ارض مصر وتذكار نياحته يوم 8 توت من كل عام
    """
    , age_id = age2.id)

db.session.add(mouse)

haron = Info(
    title = "هارون" ,
    story = """ قصة هارون الكاهن تظهر في العهد القديم في الدين المسيحي، وتتعلق بشخصية هارون الذي كان أخًا لموسى النبي ومساعده الأقرب في رحلتهما مع بني إسرائيل خلال فترة خروجهم من مصر ورحلتهم في البرية.

                        هارون كان كاهنًا يعمل بالتعاون مع موسى. وقد كُلف هارون بدور هام في قيادة الشعب الإسرائيلي أثناء غياب موسى عنهم. عندما صعد موسى إلى جبل سيناء للقاء الله وتلقي الوصايا العشر، طلب الشعب من هارون أن يصنع لهم إلهًا ليعبدوه. فأخذ هارون أقراط الذهب من أيدي الشعب وصنع بها عجلًا من الذهب، وقال للشعب إن هذا هو إلهكم الذي أخرجكم من مصر.
                        
                        عندما عاد موسى إلى الشعب ورأى ما فعله هارون، غضب وألقى لوح الوصايا على الأرض وكسر العجل الذهبي. ثم طلب من هارون أن يحاسب الشعب على خطيئتهم. وقد عاقب الله بني إسرائيل بسبب عبادتهم العجل الذهبي، وكان هارون يشعر بالندم والحزن على ما حدث.
                        
                         تُظهر قصة هارون الكاهن أهمية الوفاء لله والابتعاد عن عبادة الأصنام والتمسك بالإيمان الحقيقي. كما تُظهر أيضًا الصعوبات التي يمكن أن يواجهها القادة الروحيون في مواجهة تحديات الشعب والمحافظة على النقاء الروحي والعبادة
     """
     , age_id = age2.id)

db.session.add(haron)

mariem = Info(
    title = "مريم النبيه" ,
    story = """ مريم النبية هي شخصية تظهر في العهد القديم في الدين المسيحي، وتعتبر واحدة من النبيات البارزات في التاريخ الديني. تعرف أيضًا بمريم الأخت، وهي أخت هرون الكاهن.

مريم النبية كانت جزءًا من الجيل الذي خرج من مصر مع موسى النبي. وقد كانت معروفة بالنبوءة والتنبؤ بمستقبل الشعب الإسرائيلي. كانت تتحدث بكلمات الله وتنقل رسالاته إلى الشعب.

تظهر مريم النبية في الكتاب المقدس في سفر الخروج  بالتحديد في الفصل الخامس عشر. في هذا الفصل، يغني موسى وبنو إسرائيل ترنيمة لله بعد عبورهم البحر الأحمر وهزيمة جيش فرعون. وفي نهاية الترنيمة، تظهر مريم النبية وتأخذ الدف وتقود النساء في الرقص والترنيم احتفالًا بنصر الله.

تعد مريم النبية مثالًا للقيادة الروحية والشجاعة في العبادة والإيمان. قدمت مساهمة مهمة في تشجيع الشعب ورفع روحهم بعد خروجهم من مصر وفترة المشقة والاضطهاد التي تعرضوا لها.
 """, age_id = age2.id)

db.session.add(mariem)

esho3 = Info(
    title = "يشوع بن نون" ,
    story = """ .كان يشوع قائدًا عسكريًا وزعيمًا لبني إسرائيل بعد وفاة موسى النبي

تظهر قصة يشوع بن نون في سفر يشوع ، وهو الكتاب السادس في العهد القديم. بعد موت موسى، كان يشوع مكلفًا بقيادة بني إسرائيل وإدخالهم إلى الأرض الموعودة، وهي كنعان.

يشوع قاد الشعب في حروب عديدة ضد ملوك كنعان وشعوبهم. وقد تحققت النصرات العظيمة لبني إسرائيل بقيادة يشوع، حيث استعادوا العديد من المدن والأراضي التي كانت تحت سيطرة الأعداء.

أحد أبرز الأحداث في قصة يشوع هو سقوط أسوار مدينة أريحا بعد أن أعطى الله يشوع خطة خاصة للهجوم عليها. وقد تم تحقيق النصر واستعادة المدينة من قبضة الأعداء.

يشوع أيضًا قاد بني إسرائيل في تقسيم الأرض الموعودة بين القبائل الإسرائيلية المختلفة، والتأكد من أن كل قبيلة تحصل على نصيبها العادل.

تعتبر قصة يشوع بن نون مثالًا للإيمان والشجاعة في مواجهة التحديات والمعارك. وقد تم تمجيد يشوع كزعيم عظيم وقائد عسكري ناجح في تاريخ بني إسرائيل
  """
  , age_id = age2.id)

db.session.add(esho3)

fnhas = Info(
    title = "فنحاس" ,
    story = """ . يُذكر فنحاس في سفر العدد  وسفر الخروج  وسفر القضاة 

                        فينحاس هو ابن الكاهن إيلعازار وكان جزءًا من جيل بني إسرائيل الذي خرج من مصر. في قصة فينحاس، تظهر شجاعته وزعامته في مواجهة الخروج عن القانون وتحافظه على قدسية الله.
                        
                        في إحدى الأحداث، بدأ الشعب الإسرائيلي يزنو ويعبد آلهة ملوك موآب. وفي هذا السياق، تم جلب امرأة مديانية إلى محل الإقامة الإسرائيلي. فقام فينحاس بالتصعيد ودخل الخيمة حيث كان الرجل والمرأة، وقتلهما برمي رمح من الخلف. بفضل هذا العمل، توقفت الوبإة التي انتشرت بين بني إسرائيل.
                        
                        بعد هذا الفعل، تمنح فينحاس الكهنوت الدائم له ولذريته بسبب إيمانه القوي وعمله الشجاع للحفاظ على قدسية الله. وقد أُعطي له ولنسله العهد الخالد من الله.
                        
                        تعتبر قصة فينحاس مثالًا للشجاعة والإيمان في مواجهة الظلم والخروج عن القانون. وقد تم تمجيد فينحاس كبطل شهم وحماة للقدسية والعبادة الصحيحة في التاريخ الديني
  """
  , age_id = age2.id)

db.session.add(fnhas)

dbora = Info(
    title = "دبوره" ,
    story = """  دبورة اسم عبري معناه نحلة
كانت دبورة نبية وقاضية لإسرائيل، وكانت زوجة لفيدوت. وقد كانت تقيم تحت شجرة نخيل  ويقيم دبورة بين الرامة وبيت إيل في جبل أفرايم. وكان بنو إسرائيل يصعدون إليها للقضاء  وهناك كانت تقضي لبني إسرائيل. وقد دعت باراق ليقوم بمحاربة سيسرا  وقامت حروب نتاجها نصر دبورة 
و لم يبق ولا واح "وتبع باراق المركبات والجيش إلى حروشة الأمم... وأما سيسرا فهرب على رجليه إلى خيمة ياعيل امرأة حابر القين بالقرب من قادش. فخرجت المرأة الشجاعة "ياعيل" لاستقبال سيسرا، "فمال إليها إلى الخيمة وغطته باللحاف"، ولما طلب منها ماء ليشرب، أعطته لبنًا عوضًا عن الماء، ولما استغرق في النوم "أخذت ياعيل امرأة حابر وتد الخيمة وجعلت الميتدة في يدها وضربت الوتد في صدغه وهو متثقل في النوم ومتعب فمات". وقد أشادت دبورة بهذه القصة في نشيدها  به.  فهي ترجع إلى القرن الثالث عشر قبل الميلاد.  "يا رب بخروجك من سعير بصعودك من صحراء أدوم"  ليقاتل سيسرا، لذلك تقول: "من السموات حاربوا. الكواكب من حبكها أفلاكها حاربت سيسر فقد كانت الأمة في ورطة قاسية، يهجم عليها ملك جبار، ولم تشأ الأسباط أن تتخلى عن ميولها الانفصالية، وستجد المزيد عن هذا الموضوع هنا في موقع الأنبا تكلاهيمانوت  فظل بعضها مثل رأوبين وجلعاد ودان وأشير بعيدين، كما اختصت جماعة تسميها "ميروز" باللوم لعدم مساندتها للرب: "العنوا ميروز قال ملاك الرب، العنوا ساكنيها لعنًا لأنهم لم يأتوا لمعونة الرب، معونة الرب بين الجبابرة وكان أفرايم ويساكر وبنيامين وماكير وزبولون ممن انضموا إلى باراق
 """  , age_id = age3.id) 

db.session.add(dbora)

samwel = Info(
    title = "صموئيل" ,
    story = """            صموئيل اسم عبري معناه " الله"  هو أول أنبياء العبرانيين بعد موسى وآخر القضاة وإلى عشيرة قهات وكان افرايميًا لأن عشيرته قد أعطيت بالقرعة أن تسكن افرايم  وقد عاش ألقانة في الرامة وقد سميت بهذا الاسم   وكانت له امرأتان فننة وحنة ولم يكن لحنّة أولاد فصلت إلى الرب بحرارة فاستجيب دعاؤها وسمت الولد صموئيل وحين فطمته أتت به الي عالي الكاهن ليدربه على خدمة الرب  وكان صموئيل يخدم امام الرب  وعاش في الهيكل وكان ينام في غرفة متصلة به ويفتح أبواب الهيكل في الصباح ويساعد عالي الكاهن في الخدمةولم يكن قد تجاوز أول حداثته لما أعلن الله له أنه يقضي على بيت عالي الكاهن إلى الأبد بسبب الشر الذي صنعه ابناه و صموئيل كان له 12 عامًا من العمر في ذلك الوقت وهذه كانت سنه على وجه التقريب. وبعد هذا بقليل نفذ قضاء الله في عالي وبيته بموت ابنيه في القتال واستيلاء الفلسطينيين على التابوت وموت عالي عند سماعه هذه الأنباء وكان صموئيل نبيًا وصار بعد موت عالي صاحب السلطان الديني غير المنازع في الأرض. وأراد أن ينصرف لتقويم الشعب. فعشرين سنة بعد إرجاع التابوت رأى أن وضع الأمة الروحي تحسن فجمع  فلما سمع الفلسطينيين أن بني إسرائيل قد اجتمعوا في المصفاة صعدوا لمقاتلتهم فصلى صموئيل من اجل الشعب فأرعد الرب بصوت عظيم على الفلسطينيين فانكسروا أمام بني إسرائيل ولم يعودوا للدخول طوال حياة صموئيل وقد أظهرت هذه النجاة أن الله أقام صموئيل قاضيًا  ورئيسًا وفي قيامه بوظيفته كان يذهب من سنة إلى سنة ويجول في بيت إيل والجلجال والمصفاة ولكنه كان مقيمًا في الرامة  وهناك بنى مذبحًا للرب لأن الله ترك شيلوه وكان التابوت محجوبًا والعهد منكوثًا لأن بني إسرائيل نقضوه بالعبادة الوثنية والرجاسة فكان صموئيل ممثل يهوه. وفي أيام حكم صموئيل ممثل يهوه. وفي أيام حكم صموئيل القوي كانت البلاد حرة من الأجنبيين. ولما شاخ جعل ابنيه قاضيين لإسرائيل في بئر سبع ولكنهما لم يكونا جديرين بثقته لأنهما أخذا رشوة وعوجّا القضاء. وكان من سوء تصرفهما هذا وخطر الأمم المجاورة أن طلب شيوخ الشعب أقامه ملك عليهم فأمره الله بأن يمسح شاول. ثم بعد رفضه عيّن الله داود. ومات صموئيل لما كان داود هاربًا من وجه شاول في برية عين جدي ودفن في بيته في الرامة بعد أن ندبه جميع بني إسرائيل وفي الليلة قبل موقعة جلبوع سأل شاول العرافة في عين دور لتصعد له صموئيل  وكان هيمان أحد المغنين الذين أقامهم داود في بيت الرب حفيدًا لصموئيل  وقد عد صموئيل في قائمة العهد القديم الذين سلكوا بالإيمان
 """, age_id = age3.id)

db.session.add(samwel)

gad = Info(
    title = "جاد" , 
    story = """    يُذكر في سفر القضاة  في الكتاب المقدس.
قصة جاد تتعلق بفترة القضاة في إسرائيل، حيث كانت البلاد تعاني من الاضطراب والاختلال السياسي والديني. في هذا السياق، تم استدعاء جاد للمساعدة في قيادة بني إسرائيل في معركة ضد أعداءهم.
جاد كان رجلاً شجاعًا ومحاربًا قويًا، وقد استجاب لاستدعاء الله للخروج في المعركة. وفي إحدى المعارك، توقف المطرم وقد أُصاب جاد بالعطش الشديد. فاستغاث بالله وطلب منه أن يعطيه الماء ليروي عطشه ويعيد له القوة للمواصلة في المعركة.
في استجابة لصلاة جاد، أعطاه الله علامة خاصة. فقد اكتشف جاد ينبوعًا واحدًا صخريًا، وباستخدام قوته الفائقة، انقض عليه وكسره ليتدفق الماء منه. وشرب جاد واستعاد قوته وثم استمر في المعركة وحقق النصر.
تعتبر قصة جاد مثالًا على الإيمان والشجاعة في مواجهة التحديات. وقد تم تمجيد جاد كبطل شجاع ومحارب قوي في التاريخ الديني.
 """, age_id = age3.id)

db.session.add(gad)

dawod = Info(
    title = "داود" ,
    story = """                    يُذكر في سفر الصموئيل الأول والثاني وسفر الملوك الأول والثاني.
                     قصة داود تبدأ عندما يُمسك بوظيفة ملك إسرائيل بعد موت الملك شاول. وقد تم اختيار داود بسبب إيمانه القوي ومواهبه الفريدة، بما في ذلك موهبته في العزف على القيثارة.
                     داود أيضًا شخصية معقدة، حيث يُصف بأنه راعي غنم قبل أن يصبح ملكًا. وفي هذه الفترة، تظهر قصة داود وجليات العملاق، حيث يقوم بقتل جليات بواسطة حجر واحد من مقلاعه. وهذا الفعل يجلب له الشهرة والتقدير من قبل الشعب.
                     في حكمه كملك، يواجه داود العديد من التحديات والمحن. ومن بينها، يُغوى داود للوقوع في الخطية مع بثشبع، زوجة أوريا الحثي. وبعد أن يعلم بحمل بثشبع، يُرسل داود أوريا للموت في المعركة. ومع ذلك، يتوب داود عن خطيته ويتأسف بشدة.
                     بالرغم من خطاياه، يعتبر داود ملكًا بارًا ومختارًا في عيون الله. وقد وعد الله داود بأن سلالته ستستمر إلى الأبد، وأنه سيأتي من نسله المسيح.
                     تعتبر قصة داود مثالًا على الإيمان والتوبة والمسامحة. وقد تمجد داود كملك عظيم وراعٍ حكيم وشاعر موهوب في التاريخ الديني.
 """, age_id = age3.id)

db.session.add(dawod)

nathan = Info(
    title = "ناثان" ,
    story = """ يُذكر في سفر الصموئيل الثاني وسفر الملوك الأول والثاني.
ناثان كان نبيًا في عهد الملك داود. وقد قام بدور حاسم في حكم داود وعلاقته بالله. في قصة ناثان، يُرسل النبي إلى داود برسالة من الله بخصوص خطيته مع بثشبع، زوجة أوريا الحثي.
ناثان يستخدم قصة مثلث النابلسيين للتعبير عن الخطية والتوبة. يخبر ناثان داود عن رجل فقير يملك ضأنًا واحدًا فقط، ولكن رجلًا غنيًا يأخذ ضأنًا من الفقير لتقديمه كوجبة لضيفه. ويغضب داود ويقرر أن الرجل الغني يستحق العقاب.
ثم يكشف ناثان لداود أنه هو الرجل الغني في القصة، ويعلن عليه الحكم الذي سيأتي على بيته. يبين ناثان لداود أنه بسبب خطيته سيكون هناك صراع ومشاكل في بيته وأن الطفل الذي ولد من علاقته مع بثشبع سيموت.
وبعد أن يتوب داود بصدق ويعترف بخطيته، يغفر الله له ويعطيه نعمة الرحمة. ورغم العقاب الذي يأتي على بيت داود، يعد الله بأن سلالته ستبقى إلى الأبد.
تعتبر قصة ناثان مثالًا على النبوة والتوبة والرحمة الإلهية. وقد تمجد ناثان كنبي حكيم وشجاع في التاريخ الديني.
 """, age_id = age3.id)

db.session.add(nathan)

soliman = Info(
    title = "سليمان" ,
    story = """  يُذكر في سفر الملوك الأول والثاني في الكتاب المقدس.
قصة سليمان تركز على حكمه كملك إسرائيل وحكمة الله التي أعطاها له. بعد وفاة والده داود، تولى سليمان الحكم وأصبح ملكاً عظيماً.
يُصف سليمان بأنه رجل حكيم وفهم وعقلاني. وفي قصة سليمان، يُظهر الله حكمته ومعرفته عن طريق إلهام سليمان بحكمة فائقة. يُعتبر سليمان أيضًا بناء دير القدس وبناء الهيكل المقدس (الهيكل الأول)، والذي يُعتبر مكانًا مقدسًا للعبادة والتقرب إلى الله.
ومع ذلك، تشوب حكم سليمان بالفساد والتجارة غير الأخلاقية والزواج من النساء الأجنبيات والتساهل في العبادة الباطلة. وبسبب ذلك، يُنبه الله سليمان على خطئه ويعاقبه عن طريق تقليص مملكته بعد وفاته.
تعتبر قصة سليمان مثالًا على الحكمة والنجاح والانحراف والتوبة. وقد تمجد سليمان كملك حكيم ومبدع ومبني الهيكل في التاريخ الديني.

 """, age_id = age3.id)

db.session.add(soliman)

uoel = Info(
    title = "يوئيل" ,
    story = """ قصة يوئيل تركز على رسالته النبوية وتحذيره لشعب إسرائيل من العقاب الذي سيأتي عليهم بسبب خطاياهم. يقوم يوئيل بتنبيه الشعب بأن الجفاف والجراد والدمار سيأتون على الأرض بسبب عصيانهم وتركهم لله وتبعهم لآلهة أخرى.
وفي رؤياه، يوئيل يتنبأ أيضًا بيوم الرب العظيم، وهو يوم الحكم النهائي الذي يأتي فيه الله للدينونة والإنصاف. يحث يوئيل الشعب على التوبة والرجوع إلى الله وترك الخطايا، ويعد بأن الله سيعطي الرحمة والغفران لمن يرجعون إليه.
تعتبر قصة يوئيل مثالًا على التوبة والتحذير والرحمة الإلهية. وقد تمجد يوئيل كنبي حكيم ومبشر في التاريخ الديني
 """ , age_id = age4.id)

db.session.add(uoel)

elia = Info(
    title = "ايليا" ,
    story = """ اسم عبري ومعناه "الهي يهوه" عاش في جلعاد وكان يقضي كثير من وقته في البريه و هو الذي تنبأ عن منع المطر عن بني اسرائيل وفي السنه الثالثه من الجفاف قابل عبوديا وكيل اخاب واتفق معه علي مقابله الملك وجمع الشعب
              الي جبل الكرمل لرؤيه من يرسل النار لتلتهم المحرقه الرب ام البعل فصلي انبياء البعل ولكن لم يكن من يجيب ولكن دعا ايليا الرب فاستجاب له وزلت النار لتلتهم المحرقه ثم بعث ايليا الله ليمسح ياهو ملكا علي اسرائيل 
              وليمسح اليشع نبيا ليخلفه وفي نهايه ايام ايليا ذهب مع اليشع وضرب ايليا الأردن بثيابه فانشق الماء وسار النبيان علي اليابسه ثم جاءت مركبه وفرسان ناريه وحملت ايليا الي السماء وترك ردائه لاليشع
   """ , age_id = age4.id)

db.session.add(elia)

uonan = Info(
    title = "يونان" ,
    story = """ قصة يونان في العهد القديم تروي قصة النبي يونان الذي أُرسل من قِبَل الله لتنذير مدينة نينوى من خطاياها ودعوتها للتوبة. ومع ذلك، رفض يونان أداء مهمته وقرر الهروب من وجه الله.
هرب يونان على متن سفينة وأثار عاصفة عاتية. ولكن البحارة الموجودون على السفينة اكتشفوا أن العاصفة هي نتيجة غضب الله، فقاموا بإلقاء يونان في البحر لينقذوا أنفسهم. وفي هذه اللحظة، أرسل الله سمكة كبيرة لابتلاع يونان وإنقاذه من الموت المحتمل في الماء.
بعد ثلاثة أيام وليالٍ في بطن السمكة، توبَّ يونان وصلى إلى الله وتعهد بأداء مهمته. فأمر الله السمكة أن تقذف يونان على اليابسة، ومن ثم ذهب يونان إلى نينوى ونادى بالتوبة. فاستجاب الناس لدعوته وتابوا عن خطاياهم.
تعتبر قصة يونان مثالًا على العصاة والتوبة ورحمة الله. تُظهر القصة أيضًا أن الله لا يريد موت الخطاة بل يرغب في إعطائهم فرصة للتوبة والغفران. وقد تمجد يونان كنبي تائب ومبشر في التاريخ الديني
 """, age_id = age4.id)

db.session.add(uonan)

hosh3 = Info(
    title = "هوشع" ,
    story = """  قصة هوشع في العهد القديم تتحدث عن النبي هوشع الذي تم اختياره من قبل الله ليكون رمزًا حيًا للعلاقة بين الله وشعبه المتمرد. يُذكر هوشع في سفر هوشع في الكتاب المقدس.
تكمن قصة هوشع في معاناة شخصية النبي وزواجه من امرأة تدعى جومر، وهي امرأة زانية. تعتبر هذه القصة رمزًا للخيانة والتمرد الذي يراهن به الشعب الإسرائيلي على الله.
بعد زواجهما، تتوالى الأحداث وتكثر خيانات جومر لهوشع. ومع ذلك، يأمر الله هوشع بأخذ جومر مرة أخرى ومحبتها ورحمتها، كما أنه يدعوه لتنبيه شعبه العاصي ودعوتهم للتوبة.
تعتبر قصة هوشع مثالًا على الحب اللا مشروط من الله لشعبه رغم خياناتهم وتمردهم. تُظهر القصة أيضًا أهمية التوبة والرجوع إلى الله. وقد تمجد هوشع كنبي تائب ومبشر في التاريخ الديني.
 """, age_id = age4.id)

db.session.add(hosh3)

a3mos = Info(
    title = "عاموس" ,
    story = """ قصة عاموس في العهد القديم تروي قصة النبي عاموس الذي أُرسل من قِبَل الله لتنذير شعب إسرائيل من خطاياهم وظلمهم. ينتقد عاموس بشدة الأغنياء الظالمين والقادة الفاسدين الذين يستغلون الفقراء والمساكين. يحذر الشعب بأنه إذا لم يتوبوا ويعودوا إلى العدل والرحمة، فإنهم سوف يواجهون عقابًا شديدًا من الله.
على الرغم من أن عاموس كان راعيًا للبقر وليس نبيًا محترفًا، إلا أنه كان مطيعًا لدعوة الله وشجاعًا في إعلان رسالته. بالرغم من مقاومة الشعب ورفضهم لتحذيراته، استمر عاموس في تبليغ كلمة الله وتذكيرهم بأنهم مسؤولون عن أفعالهم.
تعتبر قصة عاموس مثالًا على أهمية العدل والرحمة في العبادة والحياة اليومية. تُظهر القصة أيضًا أن الله يراقب تصرفات البشر ويعاقب الظالمين والمستبدين. وقد تمجد عاموس كنبي شجاع ومبشر في التاريخ الديني.
 """, age_id = age4.id)

db.session.add(a3mos)

ashia = Info(
    title = "اشعياء" ,
    story = """ قصة أشعياء في العهد القديم تروي قصة النبي أشعياء الذي أُرسل من قِبَل الله للتنبؤ بالأحداث القادمة وتحذير شعب إسرائيل من خطاياهم وتخلفهم عن الله. يدعو أشعياء الشعب إلى التوبة والعودة إلى الله وترك الظلم والأعمال الشريرة.
أشعياء يتنبأ بالعقاب الذي سيأتي على شعب إسرائيل بسبب تخلفهم وتمردهم. يحذرهم من الغرق في الظلام والدمار والأسر والتشرد بسبب عصيانهم. ينتقد أشعياء بشدة الطقوس الدينية الخاوية والتضحيات الخالية من المعنى التي يقدمها الشعب.
يعرض أشعياء رؤياه ونبوءاته بشأن المسيح الذي سيأتي في المستقبل كملك وخادم ومخلص للشعب. يتحدث عن فترة السلام والرحمة التي سيجلبها المسيح وعن تأسيس ملكوت الله في الأرض.
تعتبر قصة أشعياء مثالًا على أهمية العدل والتوبة والرحمة في العبادة والحياة اليومية. تُظهر القصة أن الله يراقب تصرفات البشر ويعاقب الظالمين، وفي الوقت نفسه يعرض على الشعب فرصة التوبة والرجوع إلى الله.
يُعتبر أشعياء نبيًا مهمًا في التاريخ الديني، حيث أن رسالته تحمل تذكيرًا بأهمية العدل والتوبة والرجوع إلى الله في الحياة اليومية
 """, age_id = age4.id)

db.session.add(ashia)

armia = Info(
    title = "ارميا" ,
    story = """  قصة إرميا في العهد القديم تروي قصة النبي إرميا الذي أُرسل من قِبَل الله للتنبؤ بالأحداث القادمة وتحذير شعب يهوذا من خطاياهم وتخلفهم عن الله. يدعو إرميا الشعب إلى التوبة والعودة إلى الله وترك الأعمال الشريرة وعبادة الأصنام.
إرميا يحذر الشعب من العقاب الذي سيأتي عليهم بسبب تمردهم وتخلفهم. ينتقد إرميا بشدة القادة الفاسدين والكهنة الكاذبين الذين يضلون الشعب ويدعمون الظلم والباطل. يتوجه إرميا أيضًا إلى الأمم الأخرى لتنبيههم بالعقاب الذي سيأتي عليهم بسبب أفعالهم الشريرة.
يعاني إرميا من رفض الشعب ومعاناته الشخصية، حيث يتعرض للاضطهاد والسخرية والتهديد بالقتل. ومع ذلك، يستمر إرميا في تبليغ رسالة الله وتذكير الشعب بأنهم مسؤولون عن أفعالهم وأن العودة إلى الله هي السبيل الوحيد للخلاص.
تعتبر قصة إرميا مثالًا على أهمية العدل والتوبة والاهتمام بالشعب والتصدي للظلم والفساد. تُظهر القصة أيضًا أن الله يحمي ويدعم النبيين الشجعان الذين يتحدثون بصدق ويدعون للتوبة والعدل.
يُعتبر إرميا نبيًا مهمًا في التاريخ الديني، حيث أن رسالته تحمل تذكيرًا بأهمية العدل والتوبة والرجوع إلى الله في الحياة اليومية
 """, age_id = age4.id)

db.session.add(armia)

sfnia = Info(
    title = "صفنيا" ,
    story = """ قصة صفنيا في العهد القديم تروي قصة النبي صفنيا الذي أُرسل من قِبَل الله للتنبؤ بالأحداث القادمة وتحذير شعب يهوذا من خطاياهم وتخلفهم عن الله. يدعو صفنيا الشعب إلى التوبة والعودة إلى الله وترك الأعمال الشريرة والتمسك بالعدل
صفنيا يحذر الشعب من العقاب الذي سيأتي عليهم بسبب تمردهم وتخلفهم. ينتقد صفنيا بشدة الأمم الأخرى التي تمارس الظلم والاستبداد، ويتوجه إليها بنبوءات عن العقاب الذي سيأتي عليها بسبب أفعالها الشريرة.
صفنيا يتحدث أيضًا عن النجاة والخلاص الذي سيأتي للشعب الصالح والمتواضع الذين يعتمدون على الله ويعملون بحسب إرادته. يشجع الشعب على الثقة في الله وتوجيه حياتهم نحو العدل والتقوى.
تعتبر قصة صفنيا مثالًا على أهمية العدل والتوبة والاهتمام بالشعب والمقاومة للظلم والفساد. تُظهر القصة أيضًا أن الله يراقب تصرفات البشر ويعاقب الظالمين، وفي الوقت نفسه ينقذ ويحمي الصالحين.
يُعتبر صفنيا نبيًا مهمًا في التاريخ الديني، حيث أن رسالته تحمل تذكيرًا بأهمية العدل والتوبة والرجوع إلى الله في الحياة اليومية
 """, age_id = age4.id)

db.session.add(sfnia)

hzqial = Info(
    title = "حزقيال" ,
    story = """  حزقيال النبي نشا في فلسطين، وربما في أورشليم في بيئة الهيكل وكان شابًا في ذلك الوقت، ولم يكن طفلًا  عندما نهض اللاويون بواجباتهم وحسبوا في الإحصاء كرجال. وعاش مع المسبيين اليهود  وهو قناة في أرض بابل، وربما كانت في تل أبيب حزقيال  تزوّج ربما مبكرًا في السنة السادسة، أو على الأكثر في السنة التاسعة من السبي، وكان له بيت وزوجة بدأت خدمته النبوية في السنة الخامسة لسبي يهوياكين، أي بزمن مدته 7 سنين قبل خراب الهيكل في أورشليم، بينما كان ساكنًا على ضِفاف نهر خابور  وكان في السنة الثلاثين من عمره والنظرية أن السنة الثلاثين لا تشير إلى سن حزقيال، لكنها تاريخ محسوب أما من اعتلاء نبوخذنصر، العرش، أو من إصلاحات يوشيا، تسقط بالنظر إلى  ومع أنه كان مسبيًا في أرض غريبة. إلاّ أنه كانت له الحرية أن ينطق بنبواته. وكان يرجع إليه شيوخ الشعب لأجل النصيحة  لكن كلماته لم تتبع بأمانة  وواضح من المشابهات في الفكر واللغة أنه كان على دراية تامة بتعليم ارميا. فهو يتناول ملاحظات ارميا التعليمية، أو استعارته الإيضاحية، أو خطاباته القصيرة، ويوضحها ويوسعها، وكثيرًا ما يعطيها صيغة أدبية نهائية: مثل القدر  والأختين  والغفران للمذنبين عندما يتوبون الأمة،والفرد،والرعاة يُسْتَعَاض عنهم بالملك الداودي  المسئولية الفردية بالنظر إلى المثل عن الآباء الذين يأكلون الحصرم  الخليقة الروحية الجديدة  وللمسببين من دون اليهود الذين بقوا مقيمين، رجاء المستقبل  وقد امتد نشاط حزقيال النبوي فترة تزيد عن 22 سنة على الأقل  ولا يعرف وقت موته ولا الطريقة التي مات بها
 """, age_id = age5.id)

db.session.add(hzqial)

hbkok = Info(
    title = "حبقوق" ,
    story = """ تبدأ قصة حبقوق بشكواه إلى الرب بسبب الظلم والعنف الذي يراه في البلاد. يتساءل حبقوق عن سبب تسمح الله بالشر والظلم ولماذا لا يتدخل لتصحيح الوضع.
                يجيب الرب حبقوق ويخبره أنه سيرسل الكلديين ليعاقبوا شعبه العصاة. يصف الرب قوة الكلديين وعدوانيتهم وكيف سيسبوا على شعوب كثيرة.
                حبقوق يصاب بالدهشة والصدمة من رد الله، ويتساءل عن سبب قبول الله لشعب أشرار مثل الكلديين لتنفيذ عقابه. يبدأ حبقوق في الانتظار والصلاة، يقدم استغاثة إلى الرب وينتظر ردًا منه.
                الرب يجيب حبقوق ويوضح له أن العادل سيعيش بإيمانه، وأن الكلديين سينالون عقابهم في الوقت المحدد. يشجع الرب حبقوق على الاستمرار في الإيمان والصبر.
                في النهاية، يعبر حبقوق عن ثقته العميقة في الرب ويبدأ في ترنيمة الفرح. يعتبر أن الله هو قوته وسبب فرحه، ويعلن أنه سيثبت في الله حتى يأتي يوم الخلاص
          """, age_id = age5.id)

db.session.add(hbkok)

nahom = Info(
    title = "ناحوم" ,
    story = """                     ناحوم ينبهر بشراكة الله في العالم ويعبر عن إعجابه بقوة الله وعدالته. يتوقع ناحوم أن يعاقب الله الأشرار وينصر الصالحين
                يتنبأ ناحوم بسقوط نينوى، مدينة قوية وظالمة. يصف النبي العقاب الذي ستتعرض له نينوى وتدميرها بأيدي العدو.
                ناحوم يوجه رسالته إلى شعب الله ويشجعهم على الثقة في الرب والتمسك بالعدالة. يحثهم على تجنب الظلم والظروف السيئة، ويعد بأن الله سينتصر لهم وسيكون ملجأً لهم.
                يوضح ناحوم أن الله هو القوة والعز والمنقذ الحقيقي. يشجع النبي شعب الله على الاستسلام لإرادة الله وتوجيه حياتهم نحو الخير. 
 """, age_id = age6.id)

db.session.add(nahom)

danial = Info(
    title = "دانيال" ,
    story = """                 دانيال وثلاثة من رفاقه اليهود يُسبوا إلى بابل بعد أن احتل الملك نبوخذنصر مملكة يهوذا. يُعينوا للخدمة في القصر الملكي.
                دانيال ورفاقه يرفضون تناول الطعام والشراب من الطاولة الملكية، ويطلبون أن يُعطوا نظامًا غذائيًا يتوافق مع قوانينهم الدينية. بعد اجتيازهم اختبارًا صعبًا، يُظهرون أنهم أذكياء وأكثر حكمة من الحكماء البابليين.
                دانيال يترجم أحلام الملك نبوخذنصر ويعطيه تفسيراتها. يتنبأ دانيال بسقوط مملكة بابل وصعود مملكة ميديا وفارس، ثم يؤكد أن الله سيقيم مملكة أبدية.
                دانيال يُلقى في حفرة الأسود بسبب عبادته الحصرية لله. يظل دانيال في الحفرة ليلة واحدة، ولكن الله ينقذه ولا يمسه الأسود.
                دانيال يتنبأ بالأحداث القادمة للأمم والملوك، بما في ذلك مجيء المسيح وملكوته الأبدي
 """, age_id = age6.id)

db.session.add(danial)

azra = Info(
    title = "عزرا" ,
    story = """  كاهن يهودي عاش في فترة ما بين القرن الخامس والقرن الرابع قبل الميلاد. يروي الكتاب المقدس كيف تم انتخاب عزرا ليكون زعيما للشعب اليهودي ومحافظا على أعرافهم وقوانينهم.
تبدأ القصة بعزرا يسافر مع جماعة يهودية إلى القدس في فلسطين بعد أن تم السماح لهم بالعودة من الأسر البابلية. عند وصولهم، يجدون أن الشعب اليهودي في حالة فوضى واندثار للتقوى والعبادة الصحيحة. يبدأ عزرا في التعامل مع هذه المشكلة من خلال تعليم شعبه وذكرهم بوصايا الله وأعرافه.
يقوم عزرا بتدقيق في القوانين الدينية ويعيد تطبيقها وفقًا لما جاء في التوراة. يطلب من الناس إلقاء الملك الذي قد تزوجوا به غير اليهوديات وتأكيد التزامهم بشرائع الله. يحرق عزرا العقود غير الشرعية ويعيد الشعب اليهودي إلى العبادة الحقيقية لله. كما يعيد بناء أسوار القدس ويقوم بترميم الهيكل المقدس المدمر.
                
 """,  age_id = age7.id)

db.session.add(azra)

nhmia = Info(
    title = "نحميا" ,
    story = """ ركز قصة نحميا على دوره في إعادة بناء أسوار وأبواب القدس التي كانت مدمرة ومهدمة، مما أدى إلى ضعف واستهانة الشعب اليهودي في وجه التهديدات الخارجية. استخدم نحميا ذكائه وقدراته القيادية لتنظيم وتوجيه الشعب في عملية إعادة إعمار الأسوار والأبواب والمحافظة على أمن وسلامة القدس.
أثناء عملية البناء، واجه نحميا المعارضة والمقاومة من قبل بعض الأعداء والعائدون من الأسر البابلية، الذين حاولوا إفساد عملية البناء وزعزعة الثقة والثبات لدى الشعب. ومع ذلك ، استخدم نحميا حكمة وثباته في التعامل مع تلك التحديات واستمر في العمل حتى أتم بناء الأسوار والأبواب واستعادة نظام وأمن القدس.
بالإضافة إلى عملية البناء الجسدي، قام نحميا أيضًا بالتركيز على إصلاح الأوضاع الداخلية للشعب اليهودي. حث الشعب على التوبة والتوبة من الخطايا والانحرافات والتزام الشرائع ووصايا الله. نظم أيضا قوانين ونظام للعبادة والحياة المجتمعية.
تعتبر قصة نحميا هامة بشكل خاص لأنها تبرز الأهمية الحاسمة للقيادة القوية والثبات والإصرار في مواجهة التحديات وتحقيق الإصلاحات. تظهر القصة قوة الوحدة والتعاون بين الشعب اليهودي وقدرتهم على التغلب على المصاعب واستعادة الهوية والأمان في القدس.
 """, age_id = age7.id)

db.session.add(nhmia)

hqe = Info(
    title = "حجي" ,
    story = """ كان يعيش في القرن السادس قبل الميلاد خلال عودة بني إسرائيل من السبي البابلي.

في العام الثاني من عودتهم إلى أرضهم، وبعد أن أعيد بناء الهيكل في أورشليم، بدأ الناس يهملون بيت الرب ولا يكرسون وقتاً كافياً للعبادة. وفي هذا السياق، تلقى حجي رسالة من الرب للشعب المخلص باستدعائهم للتحرك والعمل في بناء بيت الرب.

حجي عندها توجّه لزربابل ويشوع، الحاخام العظيم، وباقي الشعب، وقال لهم إن الرب يطلب منهم وضع مصلحة بيته في المقام الأول. وأثناء العمل في بناء الهيكل، قال الرب لحجي أنه معهم وسيمنحهم نعمته وروحه لمساعدتهم في تحقيق هذا الغرض. وبموجب هذا النبوءة، أكد حجي أن الرب يبارك الشعب ويعطيهم القوة والقدرة على العمل.

استجاب الشعب لكلام حجي وبدأوا العمل مجدداً في بناء بيت الرب، ولم يتوانوا في التزامهم. وتحقّق ما تعهد به الرب على يدي حجي، حيث أخبرهم أن مجد هذا البيت سيكون أعظم من السابق.

تُعتبر قصة حجي في الكتاب المقدس رسالة تشجيعية للشعب بأهمية توجيه الاهتمام والجهود للأمور الروحية وأعمال الله في العالم. تعلمنا هذه القصة أن عندما نضع الملّاحة الروحية في حياتنا اليومية ونعمل لمجد الله، فإنه يساندنا ويعطينا القدرة على تحقيق العظمة.     
 """, age_id = age7.id)

db.session.add(hqe)

mlakhe = Info(
    title = "ملاخي" ,
    story = """ بدأ ملاخي عمله النبوي في فترة ما بعد العودة من الأسر البابلية إلى القدس. ووجه رسالاته للشعب اليهودي الذي كان في طور الانحلال الروحي والمعنوي. كان له رسائل للكهنة والشعب بشأن عدم الالتزام بواجباتهم الدينية وعدم تقديم التضحيات المناسبة، وكذلك رسائل بشأن انتشار الاختلافات الاجتماعية والاقتصادية وظلم المحكمة
                                تنبأ ملاخي أيضًا بقدوم المسيح، الذي سيكون رسولًا للعهد الجديد وسيحقق الخلاص لجميع الأمم. كما تنبأ بيوم القيامة والحكم العادل الذي سيحكمها الله
 """, age_id = age7.id)

db.session.add(mlakhe)

yohna = Info(
    title = "يوحنا المعمدان" ,
    story = """  يوحنا المعمدان هو ابن زكريا واليصاباتا، ولد بعد سنوات طويلة من عدم القدرة على الإنجاب. في النضارة، تم له أن يؤكد بشكل رسمي من قبل الملاك جبرائيل أنه سيكون له ابن ويخلص شعبه من خطاياهم. نشأ يوحنا في البرية وأصبح معروفًا بالتعليم والعتابة.

ظهر يوحنا في الأردن حيث كان يعمد الناس بالماء كتوبة لخطاياهم، مؤكدًا أنه ليس هو المسيح ولكنه أرسل لإعداد طريقه. جذب يوحنا الجموع الكثيرة وتلقى الاهتمام من الكهنة والفريسيين الذين أرسلوا إليه لمعرفة هويته.

في المناسبة التالية، بينما كان يعمد الناس في الأردن، ظهر يسوع وجاء إلى يوحنا ليعتمد. لكن يوحنا رفض في البداية وقال إنه يجب أن يعتمد هو بالماء من قبل يسوع. لكن يسوع قال له أنه يجب أن يفعل ذلك ليكون مطيعًا لإرادة الله.

عندما قدم يسوع ليعتمد، حدث شيء خارق حيث انشقت السماء ونزلت روح الله على يسوع على شكل حمامة. كما سمع رجل صوتًا من السماء يقول "أنت ابني الحبيب، بك سررت".

بعد اللقاء مع يسوع، أصبح يوحنا يشهد عنه ويناديه "حملة الله الذي يرفع خطايا العالم". أخبر التلاميذ أيضًا أنهم يجب أن يتبعوا يسوع بدلاً منه.

يوحنا المعمدان كان رسولًا بالقرب من قلب الله برسالته للناس بالتوبة والاعتراف بخطاياهم. قدم للناس فرصة للتحول والعودة إلى الله. وبواسطته أعدَّ الله الناس لاستقبال المسيح، الذي سيحمل على عاتقه خطايا العالم ويعيد الناس إلى الله.
 """, age_id = age8.id)

db.session.add(yohna)

db.session.commit()